scratchpad.org
#+OPTIONS:     H:3 num:nil toc:nil \n:nil ::t |:t ^:nil -:nil f:t *:t <:t reveal_title_slide:nil
#+REVEAL_THEME: solarized
#+REVEAL_ROOT: ./reveal.js-3.8.0

* FOO

* Dwarlixir
** c9f6725 Dwarves have X, Y coordinates and have a Registry (this is pre-Registry)
** 48fc61e Dwarves use :timer.send_interval to send themselves a ping and move to new coordinates
** 576e3f4 Create a "world" that knows if a location is taken by a dwarf
** 0d2b2ed Faker, because names are important
** 7b67cff use built-in Registry finally
- got a world
- when spinning up a dwarf, ask the world process to store its location
- moving a dwarf is ~World.move(dwarf)~
** 80e2ba8 pause the game!
- more registries can't hurt, right?
- The time registry now has a heartbeat which Ι could stop -- it sends every creature a message telling it to do its thing.
- I have timers! They hold heartbeats! They can be stopped! Wait, that sounds murderous.
** 0a823a6 Use ets for locations (because that's cool, right?)
- oh god what's with those matchspecs
- ex2ms? oh good Ι don't have to figure too much out
