scratchpad.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title></title>
<meta name="author" content="(Aldric Giacomoni)"/>
<link rel="stylesheet" href="./reveal.js-3.8.0/css/reveal.css"/>

<link rel="stylesheet" href="./reveal.js-3.8.0/css/theme/solarized.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">

<section>
<section id="slide-orgf95ddb1">
<h2 id="orgf95ddb1">FOO</h2>

</section>
</section>
<section>
<section id="slide-org193d349">
<h2 id="org193d349">Dwarlixir</h2>
<div class="outline-text-2" id="text-org193d349">
</div>
</section>
<section id="slide-org1399045">
<h3 id="org1399045">c9f6725 Dwarves have X, Y coordinates and have a Registry (this is pre-Registry)</h3>
</section>
<section id="slide-org5fecbdf">
<h3 id="org5fecbdf">48fc61e Dwarves use :timer.send_interval to send themselves a ping and move to new coordinates</h3>
</section>
<section id="slide-orga2cd7ca">
<h3 id="orga2cd7ca">576e3f4 Create a "world" that knows if a location is taken by a dwarf</h3>
</section>
<section id="slide-org6e7b77e">
<h3 id="org6e7b77e">0d2b2ed Faker, because names are important</h3>
</section>
<section id="slide-orga31801e">
<h3 id="orga31801e">7b67cff use built-in Registry finally</h3>
<ul>
<li>got a world</li>
<li>when spinning up a dwarf, ask the world process to store its location</li>
<li>moving a dwarf is <code>World.move(dwarf)</code></li>

</ul>
</section>
<section id="slide-org3f52ab9">
<h3 id="org3f52ab9">80e2ba8 pause the game!</h3>
<ul>
<li>more registries can't hurt, right?</li>
<li>The time registry now has a heartbeat which Ι could stop -- it sends every creature a message telling it to do its thing.</li>
<li>I have timers! They hold heartbeats! They can be stopped! Wait, that sounds murderous.</li>

</ul>
</section>
<section id="slide-orgca5fc78">
<h3 id="orgca5fc78">0a823a6 Use ets for locations (because that's cool, right?)</h3>
<ul>
<li>oh god what's with those matchspecs</li>
<li>ex2ms? oh good Ι don't have to figure too much out</li>

</ul>
</section>
